---
title: Fonctions en langage R | NumericalEcology.com
---

## Fonctions en langage R


* Analyse canonique de redondance (ACR)

  * <a href="http://adn.biol.umontreal.ca/~numericalecology/labo/fonctions_r/rdaTest.tar.gz"> rdaTest </a> (P. Legendre et S. Durand): Biblioth&egrave;que R pour l'analyse canonique de redondance (ACR) simple et partielle avec tests par permutation et la production des graphiques de triple projection. Des versions plus anciennes de ces fonctions se trouvent &eacute;galement dans la biblioth&egrave;que sonarX disponible sur la page <a href="http://esapubs.org/archive/">http://esapubs.org/archive/</a> de l'ESA, &agrave; l'int&eacute;rieur de "Ecological Archives A016-047-S1". <font color="red">Biblioth&egrave;que R modifi&eacute;e en avril 2014.</font>		
  * Biblioth&egrave;que <a href="http://adn.biol.umontreal.ca/~numericalecology/labo/fonctions_r/rdaTest.tar.gz"> rdaTest </a>, code-source multiplateforme (R 3.0x)
  * Biblioth&egrave;que <a href="http://adn.biol.umontreal.ca/~numericalecology/labo/fonctions_r/rdaTest_1.11.zip"> rdaTest </a> pour Windows (test&eacute;e sous R 3.0x)
  * Biblioth&egrave;que <a href="http://adn.biol.umontreal.ca/~numericalecology/labo/fonctions_r/rdaTest_1.11.tgz"> rdaTest </a> pour Mac (test&eacute;e sous R 3.0x)
  * Biblioth&egrave;que <a href="http://adn.biol.umontreal.ca/~numericalecology/labo/fonctions_r/rdaTest_1.7-old.zip"> rdaTest </a> pour Windows (version plus ancienne)
  * Biblioth&egrave;que <a href="http://adn.biol.umontreal.ca/~numericalecology/labo/fonctions_r/rdaTest_1.7.tar.gz"> rdaTest </a> pour Mac (version plus ancienne)
  * <a href="http://adn.biol.umontreal.ca/~numericalecology/labo/fonctions_r/AdjustedRsquare.R.zip"> AdjustedRsquare.R </a> (P. Legendre): Cette fonction calcule le R-carr&eacute; ajust&eacute; pour deux types de r&eacute;gression.
  * <a href="http://adn.biol.umontreal.ca/~numericalecology/labo/fonctions_r/dbRDA.D.R.zip"> dbRDA.D.R </a> (P. Legendre): Cette fonction calcule le test F de la RDA pour des matrices de distance qui ont, ou non, la propri&eacute;t&eacute; euclidienne. L'algorithme est celui de McArdle &amp; Anderson (2001). La statistique F est obtenue sans qu'il soit n&eacute;cessaire de calculer les valeurs propres et les vecteurs propres; par cons&eacute;quent, il n'est pas n&eacute;cessaire de corriger la matrice D pour &eacute;liminer les valeurs propres n&eacute;gatives.

	
* Analyse canonique des correspondances (ACC)
	
  * <a href="http://adn.biol.umontreal.ca/~numericalecology/labo/fonctions_r/CCA.zip">CCA</a> (P. Legendre): Fonction d'analyse canonique des correspondances qui sert de d&eacute;montration de l'algorithme d&eacute;crit &agrave; la sous-section 11.2.1 de Legendre and Legendre (1998).
	
* Anova et tests t
	
  * <a href="http://adn.biol.umontreal.ca/~numericalecology/labo/fonctions_r/anova.1way.R.zip"> anova.1way.R </a> (P. Legendre): Analyse de variance &agrave; un facteur avec test par permutations.
  * <a href="http://adn.biol.umontreal.ca/~numericalecology/labo/fonctions_r/anova.2way.R.zip"> anova.2way.R </a> (P. Legendre): Analyse de variance &agrave; deux facteurs crois&eacute;s (plan &eacute;quilibr&eacute;) avec tests par permutations: mod&egrave;les I, II et III.
  * <a href="http://adn.biol.umontreal.ca/~numericalecology/labo/fonctions_r/anova.2way.unbalanced.R.zip"> anova.2way.unbalanced.R </a> (P. Legendre): analyse de variance multivariable (par RDA) pour plan &eacute;quilibr&eacute; ou non &eacute;quilibr&eacute; et deux facteurs crois&eacute;s fixes; tests par permutation.
  * <a href="http://adn.biol.umontreal.ca/~numericalecology/labo/fonctions_r/anova.3way.R.zip"> anova.3way.R </a> (P. Legendre): Analyse de variance &agrave; trois facteurs crois&eacute;s (facteurs fixes, plan &eacute;quilibr&eacute;) avec tests par permutations.
  * <a href="http://adn.biol.umontreal.ca/~numericalecology/labo/fonctions_r/nest.anova.perm.R.zip"> nest.anova.perm.R </a> (D. Borcard and P. Legendre): Analyse de variance hi&eacute;rarchique &agrave; deux facteurs (plan &eacute;quilibr&eacute;) avec tests par permutations.
  * <a href="http://adn.biol.umontreal.ca/~numericalecology/labo/fonctions_r/t.perm.R.zip"> t.perm.R </a> (P. Legendre): test t pour donn&eacute;es ind&eacute;pendantes avec test par permutations.
  * <a href="http://adn.biol.umontreal.ca/~numericalecology/labo/fonctions_r/t.paired.perm.R.zip"> t.paired.perm.R </a> (P. Legendre &amp; G. Blanchet): test t pour donn&eacute;es appari&eacute;es avec test par permutations.

* <a href="http://adn.biol.umontreal.ca/~numericalecology/labo/fonctions_r/beta-diversity.zip"> beta.div </a>  (quatre fonctions et documentation) 
  * beta.div (P. Legendre): Cette fonction estime la diversit&eacute; b&ecirc;ta par la variance totale d'une matrice Y de composition en esp&egrave;ces, &agrave; travers 17 coefficients de dissimilarit&eacute; ou &agrave; partir d'un tableau de donn&eacute;es brutes. Elle calcule &eacute;galement la contribution des esp&egrave;ces (SCBD) et des sites (LCBD) &agrave; la diversit&eacute; b&ecirc;ta.
  * beta.div.comp (P. Legendre): D&eacute;composition de Podani et de Baselga d'une matrice de dissimilarit&eacute; en deux composantes appel&eacute;es Remplacement et Diff&eacute;rence de richesse ou d'abondance. La fonction peut traiter des donn&eacute;es de pr&eacute;sence-absence ou d'abondance d'esp&egrave;ces, ou encore des biomasses par esp&egrave;ce. Voir l'article de Legendre (2014). L'annexe 5 de cet article contient une fonction qui permet de calculer les indices LCBD &agrave; partir de la matrice de Dissimilarit&eacute;, de Remplacement ou de Diff&eacute;rence de richesse ou d'abondance.
  * LCBD.comp (P. Legendre): Cette fonction calcule les contributions locales &agrave; la diversit&eacute; b&ecirc;ta (indices LCBD) &agrave; partir d'une matrice de dissimilarit&eacute;s sym&eacute;trique (D) ou encore &agrave; partir de matrices de composantes de la diversit&eacute; b&ecirc;ta (remplacement, diff&eacute;rence de richesse ou d'abondance, ou embo&icirc;tement).
  * TBI (P. Legendre): Cette fonction calcule et teste la diff&eacute;rence entre les observations multivariables (donn&eacute;es de fr&eacute;quences ou de pr&eacute;sence-absence) formant des paires observ&eacute;es aux temps T1 et T2. Des indices de diversit&eacute; b&ecirc;ta temporels (TBI) sont calcul&eacute;s et test&eacute;s. Les indices TBI sont des dissimilarit&eacute;s qui mesurent la diff&eacute;renciation b&ecirc;ta au cours du temps. Ils sont calcul&eacute;s entre T1 et T2 pour chaque site s&eacute;par&eacute;ment.

* <a href="http://cc.oulu.fi/~jarioksa/softhelp/vegan.html">bgdispersal</a> (P. Legendre): Coefficients de direction de la dispersion biog&eacute;ographique. Incorpor&eacute; dans la biblioth&egrave;que <a href="http://cc.oulu.fi/~jarioksa/softhelp/vegan.html">vegan</a>. 

* <a href="http://adn.biol.umontreal.ca/~numericalecology/labo/fonctions_r/broken.stick.R.zip"> broken.stick.R </a> (P. Legendre): Calcule les valeurs attendues (esp&eacute;rances) de la distribution du b&acirc;ton bris&eacute;. 

* CADM: (P. Legendre): Concordance entre plusieurs matrices de distance. Cette fonction est maintenant int&eacute;gr&eacute;e &agrave; la biblioth&egrave;que d'analyse phylog&eacute;n&eacute;tique <a href="http://cran.r-project.org/web/packages/ape/index.html">ape</a>.

* <a href="http://cc.oulu.fi/~jarioksa/softhelp/vegan.html">cascadeKM</a> (S. Durand, M.-H. Ouellette et P. Legendre): Enveloppe de la fonction kmeans pour le partitionnement par la m&eacute;thode des K centro&iuml;des (K-means). cascadeKM cr&eacute;e plusieurs partitions qui forment une cascade allant d'un petit nombre &agrave; un plus grand nombre de groupes. Incorpor&eacute; dans la biblioth&egrave;que <a href="http://cc.oulu.fi/~jarioksa/softhelp/vegan.html">vegan</a>. <br> Distribu&eacute; &eacute;galement par l'ESA sur la page <a href="http://esapubs.org/archive/appl/A016/047/">http://esapubs.org/archive/appl/A016/047/</a>: cascadeKM fait partie du r&eacute;pertoire "Ecological Archives A016-047-S1". 

* <a href="http://adn.biol.umontreal.ca/~numericalecology/labo/fonctions_r/CCorA.zip"> CCorA </a> (P. Legendre): Analyse des corr&eacute;lations canoniques simples et partielles, Y <-> X1/X2. Une version de cette fonction qui calcule l'analyse des corr&eacute;lations canoniques simple se trouve dans la biblioth&egrave;que <a href="http://cran.r-project.org/web/packages/vegan/">vegan</a>. 

* <a href="http://adn.biol.umontreal.ca/~numericalecology/labo/fonctions_r/const.clust_1.3.tar.gz"> const.clust </a> (P. Legendre): Biblioth&egrave;que qui r&eacute;alise le groupement agglom&eacute;ratif avec contrainte de contigu&iuml;t&eacute; spatiale ou temporelle pour une matrice de distances calcul&eacute;e &agrave; partir de donn&eacute;es multivariables. Les diff&eacute;rentes solutions sont test&eacute;es par validation crois&eacute;e. Les r&eacute;sultats du groupement sont pr&eacute;sent&eacute;s sous forme de cartes. <font color="red">Biblioth&egrave;que R modifi&eacute;e le 30 mars 2014.</font>

  * Versions pour R 3.0	
    * Biblioth&egrave;que <a href="http://adn.biol.umontreal.ca/~numericalecology/labo/fonctions_r/const.clust_1.3.tar.gz"> const.clust </a>, code-source multiplateforme
    * Biblioth&egrave;que <a href="http://adn.biol.umontreal.ca/~numericalecology/labo/fonctions_r/const.clust_1.3.zip"> const.clust </a> pour Windows (R 3.01)
    * Biblioth&egrave;que <a href="http://adn.biol.umontreal.ca/~numericalecology/labo/fonctions_r/const.clust_1.3.tgz"> const.clust </a> pour Mac (R 3.01)
  * Versions pour R 2.12
    * Biblioth&egrave;que <a href="http://adn.biol.umontreal.ca/~numericalecology/labo/fonctions_r/const.clust_1.2.zip"> const.clust </a> pour Windows (test&eacute;e sous R 2.12)
    * Biblioth&egrave;que <a href="http://adn.biol.umontreal.ca/~numericalecology/labo/fonctions_r/const.clust_1.2.tgz"> const.clust </a> pour Mac (R 2.12)

* <a href="http://adn.biol.umontreal.ca/~numericalecology/labo/fonctions_r/corPerm.R.zip"> corPerm.R </a> (P. Legendre): Trois fonctions permettant de tester la signification du coefficient de corr&eacute;lation de Pearson par permutation. 

* <a href="http://adn.biol.umontreal.ca/~numericalecology/labo/fonctions_r/dagnelie.test.R.zip"> dagnelie.test.R </a> (D. Borcard, P. Legendre): Test de multinormalit&eacute; de Pierre Dagnelie.

* Diversit&eacute; fonctionnelle: <A HREF="http://cran.r-project.org/web/packages/FD/">biblioth&egrave;que FD</A> (&Eacute;tienne Lalibert&eacute;)

* Esp&egrave;ces indicatrices / diagnostiques: biblioth&egrave;que '<a href="http://vegmod.ctfc.cat">indicspecies</a>' (section "R packages")

* Fonctions g&eacute;ographiques PCNM, MEM et AEM

  * <a href="http://adn.biol.umontreal.ca/~numericalecology/labo/fonctions_r/PCNM_and pcoa.all_functions.zip">Fonction PCNM</a>: Le dossier contient les fonctions R PCNM et pcoa.all, les fichiers de documentation de ces deux fonctions (en pdf), de même qu'une page d'instructions décrivant comment utiliser ces fonctions dans la console R.

* <a href="http://pbil.univ-lyon1.fr/members/dray/">fourthcorner</a> (S. Dray): Analyse du quatri&egrave;me coin.  

* <a href="http://adn.biol.umontreal.ca/~numericalecology/labo/fonctions_r/hclust.PL.R.zip"> hclust.PL </a> (P. Legendre): Nouvelle version de la fonction "hclust" de {stats} dans laquelle le sous-programme Fortran hclust.f a &eacute;t&eacute; r&eacute;crit en langage R afin de faciliter sa modification. Cette version est utilis&eacute;e dans l'article suivant: Murtagh, F. and P. Legendre "Ward&rsquo;s hierarchical agglomerative clustering method: which algorithms implement Ward&rsquo;s criterion?" (article soumis pour publication).

* Kendall.W: Associations d'esp&egrave;ces par analyse de la concordance de Kendall. Les fonction kendall.global() et kendall.post() formant cette biblioth&egrave;que sont maintenant int&eacute;gr&eacute;e &agrave; la biblioth&egrave;que <a href="http://cran.r-project.org/web/packages/vegan/">vegan</a> d'analyse des communaut&eacute;s. 

* <a href="http://adn.biol.umontreal.ca/~numericalecology/labo/fonctions_r/manova.2way.unbalanced.R.zip"> manova.2way.unbalanced.R </a> (P. Legendre): analyse de variance pour donn&eacute;es univariables ou multivariables, deux facteurs fixes crois&eacute;s, plan &eacute;quilibr&eacute; ou non. 

* <a href="http://www.elaliberte.info/rsourcecode">manovRDa.R</a> (E. Lalibert&eacute;): Manova par RDA pour deux facteurs crois&eacute;s, fixes ou al&eacute;atoires.  

* mantel.correlog (P. Legendre): Biblioth&egrave;que pour calculer un corr&eacute;logramme multivariable de Mantel. Cette fonction est maintenant int&eacute;gr&eacute;e &agrave; la biblioth&egrave;que <a href="http://cran.r-project.org/web/packages/vegan/">vegan</a> d'analyse des communaut&eacute;s.

* Ordinations simples

  * <a href="http://adn.biol.umontreal.ca/~numericalecology/labo/fonctions_r/PCA.zip">PCA</a> (P. Legendre): Analyse en composantes principales (ACP).
  * <a href="http://adn.biol.umontreal.ca/~numericalecology/labo/fonctions_r/CA.zip">CA</a> (P. Legendre): Analyse factorielle des correspondances (AFC).	

* parafit (P. Legendre): Biblioth&egrave;que pour tester la co-&eacute;volution h&ocirc;te-parasite. Cette fonction est maintenant int&eacute;gr&eacute;e &agrave; la biblioth&egrave;que d'analyse phylog&eacute;n&eacute;tique <a href="http://cran.r-project.org/web/packages/ape/index.html">ape</a>.

* P&eacute;riodogrammes

  * <a href="http://adn.biol.umontreal.ca/~numericalecology/labo/fonctions_r/periodograph.zip"> Periodograph </a> (P. Legendre): P&eacute;riodogramme de contingence .
  * <a href="http://adn.biol.umontreal.ca/~numericalecology/labo/fonctions_r/WR.tar.gz">P&eacute;riodogramme de Whittaker-Robinson</a> (P. Legendre): Analyse p&eacute;riodique de s&eacute;ries univariables de donn&eacute;es quantitatives<br/>
  Nouvelle version plus rapide bas&eacute;e sur du code C, compil&eacute;e pour Mac OSX et Windows en avril 2014.
    * Biblioth&egrave;que <a href="http://adn.biol.umontreal.ca/~numericalecology/labo/fonctions_r/WR.tar.gz"> WR </a>, code-source multiplateforme
    * Biblioth&egrave;que <a href="http://adn.biol.umontreal.ca/~numericalecology/labo/fonctions_r/WR_1.0.zip"> WR </a> pour Windows (R 3.0x)
    * Biblioth&egrave;que <a href="http://adn.biol.umontreal.ca/~numericalecology/labo/fonctions_r/WR_1.0.tgz"> WR </a> pour Mac (R 3.0x)

* R&eacute;gression lin&eacute;aire
	
  * <a href="http://adn.biol.umontreal.ca/~numericalecology/labo/fonctions_r/multRegress.R.zip"> multRegress.R </a> (P. Legendre): Cette fonction calcule la r&eacute;gression multiple et teste le coefficient de determination (R-carr&eacute;) par permutation.
  * <a href="http://cran.r-project.org/web/packages/lmodel2/index.html">lmodel2</a> (P. Legendre): Biblioth&egrave;que pour le calcul de la r&eacute;gression lin&eacute;aire simple de mod&egrave;le II par les moindres carr&eacute;s ordinaires (MCO), l'axe majeur (AM), l'axe majeur r&eacute;duit (AMR) et l'axe majeur des donn&eacute;es cadr&eacute;es (AMDC). Disponible sur la page du <a href="http://cran.r-project.org/">CRAN</a>.
  * lmorigin (P. Legendre): Biblioth&egrave;que pour le calcul de la r&eacute;gression lin&eacute;aire multiple avec tests par permutations. Le programme inclut la r&eacute;gression par l'origine &agrave; utiliser en particulier pour l'analyse des donn&eacute;es de constrastes ind&eacute;pendants. Cette fonction est maintenant int&eacute;gr&eacute;e &agrave; la biblioth&egrave;que d'analyse phylog&eacute;n&eacute;tique <a href="http://cran.r-project.org/web/packages/ape/index.html">ape</a>.

* S&eacute;lection progressive des variables explicatives en r&eacute;gression et en analyse canonique de redondance (ACR)
	
  * packfor (S. Dray, P. Legendre et G. Blanchet): Biblioth&egrave;que compil&eacute;e  contenant les fonctions "forward.sel" et "forward.sel.par".
    * R 3.0x Mac OSX: t&eacute;l&eacute;chargez-les ici
      * Biblioth&egrave;que <a href="http://adn.biol.umontreal.ca/~numericalecology/labo/fonctions_r/AEM_0.5-1.tgz"> AEM </a> pour Mac OSX (R 3.0x)
      * Biblioth&egrave;que <a href="http://adn.biol.umontreal.ca/~numericalecology/labo/fonctions_r/packfor_0.0-8.tgz"> packfor </a> pour Mac OSX (R 3.0x)
      * Biblioth&egrave;que <a href="http://adn.biol.umontreal.ca/~numericalecology/labo/fonctions_r/PCNM_2.1-4.tgz"> PCNM </a> pour Mac OSX (R 3.0x)
      * Biblioth&egrave;que <a href="http://adn.biol.umontreal.ca/~numericalecology/labo/fonctions_r/spacemakeR_0.0-5.tgz"> spacemakeR </a> pour Mac OSX (R 3.0x)

* <a href="http://adn.biol.umontreal.ca/~numericalecology/labo/fonctions_r/seriation.zip"> seriation.R</a> (P. Legendre et S. Durand ): M&eacute;thode de s&eacute;riation de Beum &amp; Brundage (1950) pour matrices de ressemblance non sym&eacute;triques ou sym&eacute;triques.

* sonarX (S. Durand et P. Legendre): Extraction et l'analyse de signaux sonar mono-faisceaux pour la d&eacute;tection et la cartographie des habitats benthiques. Biblioth&egrave;que distribu&eacute;e par l'ESA sur la page <a href="http://esapubs.org/archive/appl/A016/047/">http://esapubs.org/archive/appl/A016/047/</a>: sonarX fait partie du r&eacute;pertoire "Ecological Archives A016-047-S1". 

* <a href="http://adn.biol.umontreal.ca/~numericalecology/labo/fonctions_r/Sidak.R.zip"> Sidak.R </a> (P. Legendre): Corrections de Bonferroni et de Sidak pour les tests multiples. 

* STI test de l'interaction espace-temps dans un plan d'&eacute;chantillonnage sans r&eacute;p&eacute;tition: biblioth&egrave;que distribu&eacute;e sur la page des programmes de Miquel De C&aacute;ceres &agrave; l'adresse <a href="http://vegmod.ctfc.cat">http://vegmod.ctfc.cat</a> 

* <a href="http://cc.oulu.fi/~jarioksa/softhelp/vegan.html">varpart</a> (P. Legendre): Partition de la variation d'un tableau-r&eacute;ponse Y en fonction de 2, 3 ou 4 tableaux de variables explicatives. Incorpor&eacute; dans la biblioth&egrave;que vegan. 

* <a href="http://adn.biol.umontreal.ca/~numericalecology/reprints/Ten_years_of_vegan.pdf"> Ten years of vegan</a> (Jari Oksanen):&nbsp;La petite histoire du d&eacute;veloppement de la biblioth&egrave;que vegan avant et depuis sa publication sur le CRAN le 6 septembre 2001.
